ab_noproxy.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        nginx/1.10.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /app/wsgi.py
Document Length:        348 bytes

Concurrency Level:      4
Time taken for tests:   1.901 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4951
Total transferred:      3004755 bytes
HTML transferred:       1740000 bytes
Requests per second:    2630.25 [#/sec] (mean)
Time per request:       1.521 [ms] (mean)
Time per request:       0.380 [ms] (mean, across all concurrent requests)
Transfer rate:          1543.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    2   9.5      0     142
Waiting:        0    1   9.5      0     142
Total:          0    2   9.5      0     142

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      1
  80%      1
  90%      2
  95%      3
  98%      6
  99%     32
 100%    142 (longest request)